In [1]:
#Q1

In [3]:
import pandas as pd

In [46]:
list = [4,8,15,16,23,42]

In [47]:
series = pd.Series(list)

In [9]:
type(series)

pandas.core.series.Series

In [10]:
#Q2

In [13]:
list_2 = [4,8,15,16,23,42,"43","nitesh","sjsk","dsnjsd"]

In [14]:
variable_series = pd.Series(list_2)

In [15]:
variable_series

0         4
1         8
2        15
3        16
4        23
5        42
6        43
7    nitesh
8      sjsk
9    dsnjsd
dtype: object

In [36]:
type(variable_series[6])

str

In [17]:
#Q3

In [53]:
df  = pd.DataFrame({"Name" : ("Alice","Bob","Claire"), "Age" : (25,30,27),"Gender" : ("Female","Male","Female")})

In [54]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [32]:
#Q4

In [34]:
# DataFrame vs Series

In [ ]:
# A dataframe is a 2-D structure that can store multiple colmns of different data types.
# A series is a 1-D array that can store a single column of any data type.

In [37]:
#1 Series can have only one column whereas data frame can have multiple columns.

In [38]:
#2 A series can only have one data type whereas data frame can have multiple data types for each column. /

In [39]:
#3 Operations behave differently

In [40]:
#4 Selections and filtering behave differently in some cases

In [41]:
#Q5

In [42]:
#manipulation : Reset index, drop column, add column , Drop duplicates etc

In [43]:
# df.drop_duplicates([3],keep = 'last')

In [44]:
#Q6

In [48]:
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [49]:
series[1] = 43

In [50]:
series

0     4
1    43
2    15
3    16
4    23
5    42
dtype: int64

In [51]:
df

      Name  Age  Gender
1    Alice   25  Female
23     Bob   30    Male
43  Claire   27  Female

In [70]:
df = df.drop(1,axis = 1)

In [71]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [74]:
df['Name'][2] = 'sujan'

C:\Users\nitesh.sethia\AppData\Local\Temp\ipykernel_25532\1596717303.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][2] = 'sujan'

In [75]:
df

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male
2  sujan   27  Female

In [76]:
# size can not be mutable in series, and data value can be mutable in all three/

In [77]:
#Q7

In [94]:
list1 = [1,2,3,4,4,5,5,4]
s1 = pd.Series(list1)

In [95]:
list2 = [12,3,4,4,4,5,3,43]
s2 = pd.Series(list2)

In [98]:
s3 = pd.concat([s1,s2],axis = 1)

In [99]:
type(s3)

pandas.core.frame.DataFrame

In [100]:
type(s1)

pandas.core.series.Series